app/views/fictions/index.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "fictions_genres" ON "genres"."id" = "fictions_genres"."genre_id" WHERE "fictions_genres"."fiction_id" = ?  [["fiction_id", 1]]
---
              <td><%= p.author %></td>
              <td><%= p.genres.map { |x| x.title + " | " }.join %></td>