app/controllers/chapters_controller.rb

SELECT  "fictions".* FROM "fictions" WHERE "fictions"."path" = ? LIMIT 1  [["path", "Tuy_Khach_Cu"]]
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."fiction_id" = ? AND "chapters"."chapnum" = ? LIMIT 1  [["fiction_id", 6], ["chapnum", 17]]
SELECT COUNT(*) FROM "chapters" WHERE "chapters"."fiction_id" = ?  [["fiction_id", 6]]
SELECT  "fictions".* FROM "fictions"  ORDER BY RANDOM() LIMIT 6
---
  def show
    @fiction = Fiction.find_by path: params[:fiction_id]
    @chapter = @fiction.chapters.where(chapnum: params[:id]).take
    @chapters = @fiction.chapters.order("chapnum ASC").page(2)
    @random = Fiction.order("RANDOM()").limit(6)