app/controllers/fictions_controller.rb

SELECT  "fictions".* FROM "fictions"  ORDER BY RANDOM() LIMIT 6
SELECT COUNT(*) FROM "fictions"
---
  def index
    @fictions = Fiction.page(params[:page])

SELECT  "fictions".* FROM "fictions" WHERE "fictions"."path" = ? LIMIT 1  [["path", "Tuy_Khach_Cu"]]
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."fiction_id" = ?  ORDER BY chapnum ASC LIMIT 5 OFFSET 0  [["fiction_id", 6]]
SELECT COUNT(*) FROM "chapters" WHERE "chapters"."fiction_id" = ?  [["fiction_id", 6]]
SELECT  "fictions".* FROM "fictions"  ORDER BY RANDOM() LIMIT 6
---
  def show
    @fiction = Fiction.find_by path: params[:id]

    @genres = @fiction.genres
    @chapters = @fiction.chapters.order("chapnum ASC").page(params[:page])

    @random = Fiction.order("RANDOM()").limit(6)