app/controllers/welcome_controller.rb

SELECT  "fictions".* FROM "fictions" WHERE "fictions"."language" = ? LIMIT 6  [["language", "en"]]
SELECT  "fictions".* FROM "fictions"  ORDER BY RANDOM() LIMIT 6
---
  def index
    @first6en = Fiction.where(language: "en").limit(6)
    @first6vn = Fiction.where(language: "vn").limit(6)
    @random = Fiction.order("RANDOM()").limit(6)